In [2]:
import mysql.connector as conn

In [29]:
mydb = conn.connect(host = 'localhost',user = 'root',passwd = 'root')

In [30]:
mydb

In [31]:
cursor = mydb.cursor()

In [32]:
cursor.execute("show databases;")

In [33]:
# the below comand will give a list of tuples
cursor.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('testshashank',)]

### Creating database

In [13]:
cursor.execute("create database testshashank")

In [14]:
cursor.execute("create table testshashank.table1(student_id INT(10), student_fname VARCHAR(30), student_lname varchar(30), rgstrn_id INT(10), classname VARCHAR(30))")

Fetching all the tables in a database

In [15]:
cursor.execute("use testshashank")

In [16]:
cursor.execute("show tables")

In [17]:
cursor.fetchall()

[('table1',)]

### Inserting record in tables

In [18]:
cursor.execute("insert into testshashank.table1 values(1, 'Shashank', 'Tripath',1,'ineuron');")

In [19]:
cursor.execute("commit;") # mydb.commit() -- both will work

In [20]:
cursor.execute("select * from testshashank.table1")

In [21]:
cursor.fetchall()

[(1, 'Shashank', 'Tripath', 1, 'ineuron')]

In [22]:
cursor.execute("insert into testshashank.table1 values(2, 'Devesh', 'Tripathi',2,'ineuron');")

In [23]:
mydb.commit()

In [34]:
cursor.execute("insert into testshashank.table1 values(3, 'Sudha', 'Tripathi',3,'ineuron');")
mydb.commit()
cursor.execute("select * from testshashank.table1")
cursor.fetchall()

[(1, 'Shashank', 'Tripath', 1, 'ineuron'),
 (2, 'Devesh', 'Tripathi', 2, 'ineuron'),
 (3, 'Sudha', 'Tripathi', 3, 'ineuron'),
 (3, 'Sudha', 'Tripathi', 3, 'ineuron')]

# Inserting Data from a file into Sql Table

In [36]:
cursor.execute("create table testshashank.GlassData(col1 INT(10),col2 FLOAT, col3 FLOAT,col4 FLOAT,col5 FLOAT,col6 FLOAT,col7 FLOAT,col8 FLOAT, col9 FLOAT, col10 FLOAT, col11 FLOAT)")

Reading file to insert data

In [46]:
with open("glass.data", 'r') as glassData:
    for line in glassData:
        cleaned_data = [item.strip() for item in line.split(',')]
        cursor.execute(f"insert into testshashank.GlassData values({cleaned_data[0]},{cleaned_data[1]},{cleaned_data[2]},{cleaned_data[3]},
                       {cleaned_data[4]},{cleaned_data[5]},{cleaned_data[6]},{cleaned_data[7]},{cleaned_data[8]},{cleaned_data[9]},{cleaned_data[10]})")
mydb.commit()

In [52]:
cursor.execute("select * from testshashank.GlassData LIMIT 10")

In [53]:
cursor.fetchall()

[(1, 1.52101, 13.64, 4.49, 1.1, 71.78, 0.06, 8.75, 0.0, 0.0, 1.0),
 (2, 1.51761, 13.89, 3.6, 1.36, 72.73, 0.48, 7.83, 0.0, 0.0, 1.0),
 (3, 1.51618, 13.53, 3.55, 1.54, 72.99, 0.39, 7.78, 0.0, 0.0, 1.0),
 (4, 1.51766, 13.21, 3.69, 1.29, 72.61, 0.57, 8.22, 0.0, 0.0, 1.0),
 (5, 1.51742, 13.27, 3.62, 1.24, 73.08, 0.55, 8.07, 0.0, 0.0, 1.0),
 (6, 1.51596, 12.79, 3.61, 1.62, 72.97, 0.64, 8.07, 0.0, 0.26, 1.0),
 (7, 1.51743, 13.3, 3.6, 1.14, 73.09, 0.58, 8.17, 0.0, 0.0, 1.0),
 (8, 1.51756, 13.15, 3.61, 1.05, 73.24, 0.57, 8.24, 0.0, 0.0, 1.0),
 (9, 1.51918, 14.04, 3.58, 1.37, 72.08, 0.56, 8.3, 0.0, 0.0, 1.0),
 (10, 1.51755, 13.0, 3.6, 1.36, 72.99, 0.57, 8.4, 0.0, 0.11, 1.0)]

## Reading the sql code using Pandas :- as long as we are trying to read something it will work but a command like use database will not work

In [54]:
import pandas as pd

pd.read_sql("select * from testshashank.GlassData limit 10", mydb)

C:\Users\ShashankTripathi\AppData\Local\Temp\ipykernel_23832\2939360067.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("select * from testshashank.GlassData limit 10", mydb)

   col1     col2   col3  col4  col5   col6  col7  col8  col9  col10  col11
0     1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75   0.0   0.00    1.0
1     2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83   0.0   0.00    1.0
2     3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78   0.0   0.00    1.0
3     4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22   0.0   0.00    1.0
4     5  1.51742  13.27  3.62  1.24  73.08  0.55  8.07   0.0   0.00    1.0
5     6  1.51596  12.79  3.61  1.62  72.97  0.64  8.07   0.0   0.26    1.0
6     7  1.51743  13.30  3.60  1.14  73.09  0.58  8.17   0.0   0.00    1.0
7     8  1.51756  13.15  3.61  1.05  73.24  0.57  8.24   0.0   0.00    1.0
8     9  1.51918  14.04  3.58  1.37  72.08  0.56  8.30   0.0   0.00    1.0
9    10  1.51755  13.00  3.60  1.36  72.99  0.57  8.40   0.0   0.11    1.0